In [ ]:
from pyspark import SparkContext
from pyspark.sql import SQLContext, Row
import pandas as pd
sc = SparkContext('local')
sqlCtx = SQLContext(sc)

In [ ]:

data1 = [
    ('홍길동,1000'),
    ('이순신,2000'),
    ('임꺽정,3000'),
    ('김철수,4000'),
    ('이황,5000'),
    ('이이,6000'),

]
# sparkdataframe 변환후 아래 문제를 spark sql로 작성

In [ ]:
main = sc.parallelize(data1)
main_df = sqlCtx.createDataFrame( main.map(lambda x: (x.split(',')[0], int(x.split(',')[1]))) ,['name','salary'],)

In [ ]:
main_df.show()

+------+------+
|  name|salary|
+------+------+
|홍길동|  1000|
|이순신|  2000|
|임꺽정|  3000|
|김철수|  4000|
|  이황|  5000|
|  이이|  6000|
+------+------+

In [ ]:
main_df.createOrReplaceTempView('main_df')

In [ ]:
# prob_1
sql =  'SELECT * FROM main_df WHERE SALARY = (SELECT MAX(SALARY) FROM main_df)'
sqlDF=sqlCtx.sql(sql)
sqlDF.show()

+----+------+
|name|salary|
+----+------+
|이이|  6000|
+----+------+

In [ ]:
# prob_2
sql =  'SELECT *, (salary-salary*0.033) AS TAX FROM main_df '
sqlDF=sqlCtx.sql(sql)
sqlDF.show()

+------+------+--------+
|  name|salary|     TAX|
+------+------+--------+
|홍길동|  1000| 967.000|
|이순신|  2000|1934.000|
|임꺽정|  3000|2901.000|
|김철수|  4000|3868.000|
|  이황|  5000|4835.000|
|  이이|  6000|5802.000|
+------+------+--------+

In [ ]:
# prob_3
sql =  'SELECT *  FROM main_df WHERE NAME LIKE ("%철%") '
sqlDF=sqlCtx.sql(sql)
sqlDF.show()

+------+------+
|  name|salary|
+------+------+
|김철수|  4000|
+------+------+

In [ ]:
# prob_4
sql =  'SELECT *  FROM main_df ORDER BY SALARY DESC LIMIT 5'
sqlDF=sqlCtx.sql(sql)
sqlDF.show()

+------+------+
|  name|salary|
+------+------+
|  이이|  6000|
|  이황|  5000|
|김철수|  4000|
|임꺽정|  3000|
|이순신|  2000|
+------+------+

In [ ]:
# prob_5
sql =  'SELECT *  FROM main_df WHERE SALARY BETWEEN 2000 AND 4000'
sqlDF=sqlCtx.sql(sql)
sqlDF.show()

+------+------+
|  name|salary|
+------+------+
|이순신|  2000|
|임꺽정|  3000|
|김철수|  4000|
+------+------+

In [ ]:
# prob_6
# 임금의 최댓값과 최솟값의 차이를 구하시오
sql =  'SELECT MAX(SALARY)-MIN(SALARY) AS DIFF_SALARY  FROM main_df'
sqlDF=sqlCtx.sql(sql)
sqlDF.show()

+-----------+
|DIFF_SALARY|
+-----------+
|       5000|
+-----------+

In [ ]:
# prob_7
# 임금의 표준편차를 구하시오 단 (db는 표본집단임) 구하시오
sql =  'SELECT STD(SALARY)*(COUNT(*)/(COUNT(*)-1)) AS STD_SALARY  FROM main_df'
sqlDF=sqlCtx.sql(sql)
sqlDF.show()

+------------------+
|        STD_SALARY|
+------------------+
|2244.9944320643644|
+------------------+

In [ ]:
# prob_8
# 최소 임금을 받는 데이터 출력
sql = 'select name,salary from main_df order by salary limit 1'
sqlDF = sqlCtx.sql(sql)
sqlDF.show()

+------+------+
|  name|salary|
+------+------+
|홍길동|  1000|
+------+------+

In [ ]:
# prob_9
#글자수가 2 이하인 데이터 출력
sql = 'select name,salary from main_df where length(name)<3'
sqlDF = sqlCtx.sql(sql)
sqlDF.show()

+----+------+
|name|salary|
+----+------+
|이황|  5000|
|이이|  6000|
+----+------+

In [ ]:
# prob_10
#이로 시작하는 사람들의 임금합
sql = "select sum(salary) from main_df where name like '이%'"
sqlDF = sqlCtx.sql(sql)
sqlDF.show()

+-----------+
|sum(salary)|
+-----------+
|      13000|
+-----------+